---
type: LevelAssociationData
namespace: Autodesk.Revit.DB
version: 2024
members: 6
tags: [revit-api, class]
---

# LevelAssociationData

`Autodesk.Revit.DB.LevelAssociationData` · Revit 2024 · 6 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | Dispose | — | `public void Dispose ()` |
| Method | GetAssociatedLevel | 2023 | `public ElementId GetAssociatedLevel ()` |
| Method | GetLevelAssociationData | 2023 | `public static LevelAssociationData GetLevelAssociationData ( Element element )` |
| Method | GetLevelOffset | 2023 | `public double GetLevelOffset ()` |
| Method | SetAssociatedLevel | 2023 | `public void SetAssociatedLevel ( ElementId levelId )` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |